rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_EMAC.h
#define EMAC_MAC_VLAN_INCL3_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL3_CSVL_SHIFT           (19U)
#define EMAC_MAC_VLAN_INCL3_CSVL_WIDTH           (1U)
#define EMAC_MAC_VLAN_INCL3_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL3_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL3_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL4 - MAC VLAN Inclusion 4 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL4_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL4_VLT_SHIFT            (0U)
#define EMAC_MAC_VLAN_INCL4_VLT_WIDTH            (16U)
#define EMAC_MAC_VLAN_INCL4_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL4_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL4_VLT_MASK)

#define EMAC_MAC_VLAN_INCL4_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL4_CSVL_SHIFT           (19U)
#define EMAC_MAC_VLAN_INCL4_CSVL_WIDTH           (1U)
#define EMAC_MAC_VLAN_INCL4_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL4_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL4_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL5 - MAC VLAN Inclusion 5 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL5_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL5_VLT_SHIFT            (0U)
#define EMAC_MAC_VLAN_INCL5_VLT_WIDTH            (16U)
#define EMAC_MAC_VLAN_INCL5_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL5_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL5_VLT_MASK)

#define EMAC_MAC_VLAN_INCL5_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL5_CSVL_SHIFT           (19U)
#define EMAC_MAC_VLAN_INCL5_CSVL_WIDTH           (1U)
#define EMAC_MAC_VLAN_INCL5_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL5_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL5_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL6 - MAC VLAN Inclusion 6 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL6_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL6_VLT_SHIFT            (0U)
#define EMAC_MAC_VLAN_INCL6_VLT_WIDTH            (16U)
#define EMAC_MAC_VLAN_INCL6_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL6_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL6_VLT_MASK)

#define EMAC_MAC_VLAN_INCL6_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL6_CSVL_SHIFT           (19U)
#define EMAC_MAC_VLAN_INCL6_CSVL_WIDTH           (1U)
#define EMAC_MAC_VLAN_INCL6_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL6_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL6_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL7 - MAC VLAN Inclusion 7 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL7_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL7_VLT_SHIFT            (0U)
#define EMAC_MAC_VLAN_INCL7_VLT_WIDTH            (16U)
#define EMAC_MAC_VLAN_INCL7_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL7_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL7_VLT_MASK)

#define EMAC_MAC_VLAN_INCL7_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL7_CSVL_SHIFT           (19U)
#define EMAC_MAC_VLAN_INCL7_CSVL_WIDTH           (1U)
#define EMAC_MAC_VLAN_INCL7_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL7_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL7_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL - MAC VLAN Inclusion Or Replacement */
/*! @{ */

#define EMAC_MAC_VLAN_INCL_VLT_MASK              (0xFFFFU)
#define EMAC_MAC_VLAN_INCL_VLT_SHIFT             (0U)
#define EMAC_MAC_VLAN_INCL_VLT_WIDTH             (16U)
#define EMAC_MAC_VLAN_INCL_VLT(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL_VLT_MASK)

#define EMAC_MAC_VLAN_INCL_VLC_MASK              (0x30000U)
#define EMAC_MAC_VLAN_INCL_VLC_SHIFT             (16U)
#define EMAC_MAC_VLAN_INCL_VLC_WIDTH             (2U)
#define EMAC_MAC_VLAN_INCL_VLC(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLC_SHIFT)) & EMAC_MAC_VLAN_INCL_VLC_MASK)

#define EMAC_MAC_VLAN_INCL_VLP_MASK              (0x40000U)
#define EMAC_MAC_VLAN_INCL_VLP_SHIFT             (18U)
#define EMAC_MAC_VLAN_INCL_VLP_WIDTH             (1U)
#define EMAC_MAC_VLAN_INCL_VLP(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLP_SHIFT)) & EMAC_MAC_VLAN_INCL_VLP_MASK)

#define EMAC_MAC_VLAN_INCL_CSVL_MASK             (0x80000U)
#define EMAC_MAC_VLAN_INCL_CSVL_SHIFT            (19U)
#define EMAC_MAC_VLAN_INCL_CSVL_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_CSVL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL_CSVL_MASK)

#define EMAC_MAC_VLAN_INCL_VLTI_MASK             (0x100000U)
#define EMAC_MAC_VLAN_INCL_VLTI_SHIFT            (20U)
#define EMAC_MAC_VLAN_INCL_VLTI_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_VLTI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLTI_SHIFT)) & EMAC_MAC_VLAN_INCL_VLTI_MASK)

#define EMAC_MAC_VLAN_INCL_CBTI_MASK             (0x200000U)
#define EMAC_MAC_VLAN_INCL_CBTI_SHIFT            (21U)
#define EMAC_MAC_VLAN_INCL_CBTI_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_CBTI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_CBTI_SHIFT)) & EMAC_MAC_VLAN_INCL_CBTI_MASK)

#define EMAC_MAC_VLAN_INCL_ADDR_MASK             (0x1000000U)
#define EMAC_MAC_VLAN_INCL_ADDR_SHIFT            (24U)
#define EMAC_MAC_VLAN_INCL_ADDR_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_ADDR_SHIFT)) & EMAC_MAC_VLAN_INCL_ADDR_MASK)

#define EMAC_MAC_VLAN_INCL_RDWR_MASK             (0x40000000U)
#define EMAC_MAC_VLAN_INCL_RDWR_SHIFT            (30U)
#define EMAC_MAC_VLAN_INCL_RDWR_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_RDWR(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_RDWR_SHIFT)) & EMAC_MAC_VLAN_INCL_RDWR_MASK)

#define EMAC_MAC_VLAN_INCL_BUSY_MASK             (0x80000000U)
#define EMAC_MAC_VLAN_INCL_BUSY_SHIFT            (31U)
#define EMAC_MAC_VLAN_INCL_BUSY_WIDTH            (1U)
#define EMAC_MAC_VLAN_INCL_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_BUSY_SHIFT)) & EMAC_MAC_VLAN_INCL_BUSY_MASK)
/*! @} */

