rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_EMAC.h
#define EMAC_DMA_CH0_STATUS_RWT_MASK             (0x200U)
#define EMAC_DMA_CH0_STATUS_RWT_SHIFT            (9U)
#define EMAC_DMA_CH0_STATUS_RWT_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_RWT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_RWT_SHIFT)) & EMAC_DMA_CH0_STATUS_RWT_MASK)

#define EMAC_DMA_CH0_STATUS_ETI_MASK             (0x400U)
#define EMAC_DMA_CH0_STATUS_ETI_SHIFT            (10U)
#define EMAC_DMA_CH0_STATUS_ETI_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_ETI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_ETI_SHIFT)) & EMAC_DMA_CH0_STATUS_ETI_MASK)

#define EMAC_DMA_CH0_STATUS_ERI_MASK             (0x800U)
#define EMAC_DMA_CH0_STATUS_ERI_SHIFT            (11U)
#define EMAC_DMA_CH0_STATUS_ERI_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_ERI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_ERI_SHIFT)) & EMAC_DMA_CH0_STATUS_ERI_MASK)

#define EMAC_DMA_CH0_STATUS_FBE_MASK             (0x1000U)
#define EMAC_DMA_CH0_STATUS_FBE_SHIFT            (12U)
#define EMAC_DMA_CH0_STATUS_FBE_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_FBE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_FBE_SHIFT)) & EMAC_DMA_CH0_STATUS_FBE_MASK)

#define EMAC_DMA_CH0_STATUS_CDE_MASK             (0x2000U)
#define EMAC_DMA_CH0_STATUS_CDE_SHIFT            (13U)
#define EMAC_DMA_CH0_STATUS_CDE_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_CDE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_CDE_SHIFT)) & EMAC_DMA_CH0_STATUS_CDE_MASK)

#define EMAC_DMA_CH0_STATUS_AIS_MASK             (0x4000U)
#define EMAC_DMA_CH0_STATUS_AIS_SHIFT            (14U)
#define EMAC_DMA_CH0_STATUS_AIS_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_AIS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_AIS_SHIFT)) & EMAC_DMA_CH0_STATUS_AIS_MASK)

#define EMAC_DMA_CH0_STATUS_NIS_MASK             (0x8000U)
#define EMAC_DMA_CH0_STATUS_NIS_SHIFT            (15U)
#define EMAC_DMA_CH0_STATUS_NIS_WIDTH            (1U)
#define EMAC_DMA_CH0_STATUS_NIS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_NIS_SHIFT)) & EMAC_DMA_CH0_STATUS_NIS_MASK)

#define EMAC_DMA_CH0_STATUS_TEB_MASK             (0x70000U)
#define EMAC_DMA_CH0_STATUS_TEB_SHIFT            (16U)
#define EMAC_DMA_CH0_STATUS_TEB_WIDTH            (3U)
#define EMAC_DMA_CH0_STATUS_TEB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_TEB_SHIFT)) & EMAC_DMA_CH0_STATUS_TEB_MASK)

#define EMAC_DMA_CH0_STATUS_REB_MASK             (0x380000U)
#define EMAC_DMA_CH0_STATUS_REB_SHIFT            (19U)
#define EMAC_DMA_CH0_STATUS_REB_WIDTH            (3U)
#define EMAC_DMA_CH0_STATUS_REB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_STATUS_REB_SHIFT)) & EMAC_DMA_CH0_STATUS_REB_MASK)
/*! @} */

/*! @name DMA_CH0_MISS_FRAME_CNT - DMA Channel 0 Miss Frame Counter */
/*! @{ */

#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK     (0x7FFU)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT    (0U)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_WIDTH    (11U)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT)) & EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK)

#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO_MASK    (0x8000U)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO_SHIFT   (15U)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO_WIDTH   (1U)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO_SHIFT)) & EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO_MASK)
/*! @} */

/*! @name DMA_CH0_RXP_ACCEPT_CNT - DMA Channel 0 Rx Parser Accept Count */
/*! @{ */

#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_MASK   (0x7FFFFFFFU)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_SHIFT  (0U)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_WIDTH  (31U)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_SHIFT)) & EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_MASK)

#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF_MASK (0x80000000U)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF_SHIFT (31U)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF_WIDTH (1U)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF_SHIFT)) & EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF_MASK)
/*! @} */

/*! @name DMA_CH0_RX_ERI_CNT - DMA Channel 0 Rx ERI Count */
/*! @{ */

#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT_MASK        (0xFFFU)
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT_SHIFT       (0U)
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT_WIDTH       (12U)
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RX_ERI_CNT_ECNT_SHIFT)) & EMAC_DMA_CH0_RX_ERI_CNT_ECNT_MASK)
/*! @} */

/*! @name DMA_CH1_CONTROL - DMA Channel 1 Control */
/*! @{ */

#define EMAC_DMA_CH1_CONTROL_PBLx8_MASK          (0x10000U)
#define EMAC_DMA_CH1_CONTROL_PBLx8_SHIFT         (16U)
#define EMAC_DMA_CH1_CONTROL_PBLx8_WIDTH         (1U)
#define EMAC_DMA_CH1_CONTROL_PBLx8(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_CONTROL_PBLx8_SHIFT)) & EMAC_DMA_CH1_CONTROL_PBLx8_MASK)

#define EMAC_DMA_CH1_CONTROL_DSL_MASK            (0x1C0000U)
#define EMAC_DMA_CH1_CONTROL_DSL_SHIFT           (18U)
#define EMAC_DMA_CH1_CONTROL_DSL_WIDTH           (3U)
#define EMAC_DMA_CH1_CONTROL_DSL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_CONTROL_DSL_SHIFT)) & EMAC_DMA_CH1_CONTROL_DSL_MASK)
/*! @} */

/*! @name DMA_CH1_TX_CONTROL - DMA Channel 1 Tx Control */
/*! @{ */

#define EMAC_DMA_CH1_TX_CONTROL_ST_MASK          (0x1U)
#define EMAC_DMA_CH1_TX_CONTROL_ST_SHIFT         (0U)
#define EMAC_DMA_CH1_TX_CONTROL_ST_WIDTH         (1U)
#define EMAC_DMA_CH1_TX_CONTROL_ST(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_ST_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_ST_MASK)

#define EMAC_DMA_CH1_TX_CONTROL_TCW_MASK         (0xEU)
#define EMAC_DMA_CH1_TX_CONTROL_TCW_SHIFT        (1U)
#define EMAC_DMA_CH1_TX_CONTROL_TCW_WIDTH        (3U)
#define EMAC_DMA_CH1_TX_CONTROL_TCW(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_TCW_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_TCW_MASK)

#define EMAC_DMA_CH1_TX_CONTROL_OSF_MASK         (0x10U)
#define EMAC_DMA_CH1_TX_CONTROL_OSF_SHIFT        (4U)
#define EMAC_DMA_CH1_TX_CONTROL_OSF_WIDTH        (1U)
#define EMAC_DMA_CH1_TX_CONTROL_OSF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_OSF_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_OSF_MASK)

#define EMAC_DMA_CH1_TX_CONTROL_TxPBL_MASK       (0x3F0000U)
#define EMAC_DMA_CH1_TX_CONTROL_TxPBL_SHIFT      (16U)
#define EMAC_DMA_CH1_TX_CONTROL_TxPBL_WIDTH      (6U)
#define EMAC_DMA_CH1_TX_CONTROL_TxPBL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_TxPBL_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_TxPBL_MASK)

#define EMAC_DMA_CH1_TX_CONTROL_ETIC_MASK        (0x400000U)
#define EMAC_DMA_CH1_TX_CONTROL_ETIC_SHIFT       (22U)
#define EMAC_DMA_CH1_TX_CONTROL_ETIC_WIDTH       (1U)
#define EMAC_DMA_CH1_TX_CONTROL_ETIC(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_ETIC_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_ETIC_MASK)

#define EMAC_DMA_CH1_TX_CONTROL_EDSE_MASK        (0x10000000U)
#define EMAC_DMA_CH1_TX_CONTROL_EDSE_SHIFT       (28U)
#define EMAC_DMA_CH1_TX_CONTROL_EDSE_WIDTH       (1U)
#define EMAC_DMA_CH1_TX_CONTROL_EDSE(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_TX_CONTROL_EDSE_SHIFT)) & EMAC_DMA_CH1_TX_CONTROL_EDSE_MASK)
/*! @} */

